{
  "finding": {
    "findingDetails": {
      "findingMatrix":
        {
          "title": "Insecure SYSVOL Scripts",
          "vsr": 3,
          "cvss": "4.0-5.9",
          "risk": "Medium",
          "id": "OS-CFDB-1006"
        },
      "findingService": [
        {
          "service": "Internal Penetration Testing"
        },
        {
          "service": "External Penetration Testing"
        }
      ],
      "nistControls" : [
        {
          "nist": "IA-2"
        },
        {
          "nist": "IA-7"
        }
      ],
      "mitreAttack" : [
        {
          "name": "Credentials in Files",
          "tactic": "Credential Access",
          "id": "T1081",
          "link": "https://attack.mitre.org/wiki/Technique/T1081"
        }  
      ],
      "findingRefrences": [
        {
          "url": "https://adsecurity.org/?p=2288"
        }
      ]
    },
    "technicalInformation": {
      "description": "The SYSVOL folder on DC's (Domain Controllers) is a domain-wide network share in Active Directory (AD) to which all authenticated users in the domain have by default read access. The directory contains login scripts, group policy data, and other data that may be needed to be available to all users. The assessment team discovered that scripts within this folder contain sensitive information that may aid an attacker in lateral movement and reconnaissance. Within these scripts also contained clear text credentials to other domain resources.",
      "impact": "If an attacker can gain access to the domain environment, they effectively can use these gathered credentials to attempt privilege escalation. These "User" credentials could result in further lateral movement or the ability to gain unauthorized access to different regions within the domain.",
      "recommendation": "he assessment team recommends that scripts used for administration, password changes, authenticated share mounting be removed. Automated password changes and authenticated share mounting should be accomplished with proper AD group delegation. A thorough audit should be conducted domain wide to identify other scripts exposing sensitive data or credentials."
    },
    "findingMetadata": {
      "findingdDevelopment": [
        {
          "authorName": "Alexander Rymdeko-Harvey",
          "twitterHandle": "@Killswitch-GUI",
          "email": "os-cfdb@obscuritylabs.com",
          "created": "09/27/2017",
          "updated": "09/27/2017"
        }
      ]
    }
  }
}
